#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>

//int main()
//{
//	int r = 7 / 2;
//	printf("%d\n", r);
//
//	double d = 7 / 2;
//	printf("%lf\n", d);//3.5?  
//
//
//	double c = 7/ 2.0;// 需要转换为浮点数
//	printf("%lf\n", c);//3.5?
//
//	return 0;
//}

//int main()
//{
//	int a = 15;
//	//00000000000000000000000000001111 - 原码
//	//00000000000000000000000000001111 - 反码
//	//00000000000000000000000000001111 - 补码
//
//	int b = -15;
//	//10000000000000000000000000001111 - 原码 首位为1 表示为负数
//	//11111111111111111111111111110000 - 反码(原码的符号位不变，其他位按位取反得到的就是反码)
//	//11111111111111111111111111110001 - 补码(反码+1就是补码)
//
//	//整数在内存中存储的是补码
//	//计算的时候也是使用补码计算的
//	return 0;
//}


//int main()
//{
//	int a = 15;
//	int b = a >> 1;
//	// 原码 00000000000000000000000000000111
//	// 反码 00000000000000000000000000000111
//	// 补码 00000000000000000000000000000111 ——> 1*2^2+1*2^1+1*2^0 = 7
//	printf("%d\n", b);
//	printf("%d\n", a);
//	return 0;
//}


//int main()
//{
//	int a = -15;
//	// 原码 10000000000000000000000000001111
//	// 反码 11111111111111111111111111110000
//	// 补码 11111111111111111111111111110001
//	int b = a >> 1;
//	// 移动后的补码 11111111111111111111111111111000
//	// 反码 11111111111111111111111111110111 补码—1
//	// 原码 10000000000000000000000000001000  -8
//	printf("%d\n", b);
//	printf("%d\n", a);
//	return 0;
//}


//int main()
//{
//	int a = 6;
//	// 左移操作符
//	// 左边丢弃， 右边补0
//	// [00000000000000000000000000000110] - 6的补码
//	a = a << 1;
//	//a<<=1;
//	// [00000000000000000000000000001100] - 移动后的补码
//	// [00000000000000000000000000001100] - 反码
//	// [00000000000000000000000000001100] - 原码  1*2^3+1*2^2 = 12
//	printf("%d\n", a);//12
//	return 0;
//}

//int main()
//{
//	int a = 5;
//	int b = a >> 2 // 可以移动一位 也可以两位 三位......
//	int b = a >> -2;//标准未定义行为
//	printf("%d\n", b);
//	return 0;
//}

//int main()
//{
//	int a = 3;
//	//00000000000000000000000000000011 -- 补码
//
//	int b = -5;
//	//10000000000000000000000000000101 -- 原码
//	//11111111111111111111111111111010 -- 反码
//	//11111111111111111111111111111011 -- 补码
//
//	int c = a | b;
//	//  | - 按（2进制）位或 - 对应的二进制位有1则为1，两个同时为0才是0
//	//00000000000000000000000000000011 -- a补码
//	//11111111111111111111111111111011 -- b补码
//	//11111111111111111111111111111011 -- c补码
//	//11111111111111111111111111111010 -- c反码
//	//10000000000000000000000000000101 -- c原码 -5
//	printf("%d\n", c);// 3
//	return 0;
//}
//


//int main()
//{
//	int a = 3;
//	//00000000000000000000000000000011 -- 补码
//
//	int b = -5;
//	//10000000000000000000000000000101 -- 原码
//	//11111111111111111111111111111010 -- 反码
//	//11111111111111111111111111111011 -- 补码
//
//	int c = a ^ b;
//	//  ^ - 按二进制位异或 -对应的二进制位相同为0，相异为1
//	//00000000000000000000000000000011 -- a补码
//	//11111111111111111111111111111011 -- b补码
//	//11111111111111111111111111111000 -- c补码
//	//11111111111111111111111111110111 -- c反码
//	//10000000000000000000000000001000 -- c原码 -8
//	printf("%d\n", c);// -8
//	return 0;
//}
//


//交换2个整型变量
//不能创建临时变量（第三个变量），实现两个整数的交换

//int main()
//{
//	int a = 3;
//	int b = 5;
//	printf("交换前: a=%d b=%d\n", a, b);
//	/*int tmp = a;
//	a = b;
//	b = tmp;*/
//
//	/*a = a + b;
//	b = a - b;
//	a = a - b;*/
//
//	a = a ^ b;
//	b = a ^ b;
//	a = a ^ b;
//
//	printf("交换后: a=%d b=%d\n", a, b);
//	return 0;
//}


//int weight = 120;//体重
//weight = 89;//不满意就赋值
//double salary = 10000.0;
//salary = 20000.0;//使用赋值操作符赋值。
//赋值操作符可以连续使用，比如：
//int a = 10;
//int x = 0;
//int y = 20;
//a = x = y + 1;//连续赋值
//这样的代码感觉怎么样？
//那同样的语义，你看看：
//x = y + 1;
//a = x;
//这样的写法是不是更加清晰爽朗而且易于调试。

//int main()
//{
//	int flag = 5;
//	if (flag == 0)
//	{
//		printf("hehe\n");
//	}
//	if (!flag)//flag 为假 打印hehe
//	{
//		printf("hehe\n");
//	}
//	if (flag)
//	{
//		printf("haha\n");
//	}
//	return 0;
//}

//int main()
//{
//	int a = 5;
//	int b = -a;
//	printf("%d\n", b);
//	return 0;
//}


//int main()
//{
//	int a = 10;
//	//pa是指针变量
//	int* pa = &a;// * 说明pa 是指针变量   &-取地址操作符-取出a的地址
//
//	*pa = 20;// *  解引用操作符(间接访问操作符)-单目操作符-通过pa中存放的地址，找到指向的空间（内容）
//	int c = *pa;
//
//	return 0;
//}

//int main()
//{
//	int a = 10;
//	printf("%d\n", sizeof(int));
//	printf("%d\n", sizeof(a));
//	printf("%d\n", sizeof a);//说明sizeof不是函数
//
//	return 0;
//}

//int main()
//{
//	int arr[10] = {0};
//	printf("%d\n", sizeof(arr));//40 - 计算整个数组的大小，单位字节
//	printf("%d\n", sizeof(int [10]));//
//	return 0;
//}


//int main()
//{
//	int a = 0;
//	printf("%d\n", ~a);//?
//	//00000000000000000000000000000000 - a 补码
//	//11111111111111111111111111111111 - 取反后补码
//	//11111111111111111111111111111110 - 反码
//	//10000000000000000000000000000001 - 原码  -1
//	return 0;
//}


//int main()
//{
//	int a = 13;
//	//00000000000000000000000000001101 -原码
//	//00000000000000000000000000001101 - 如果我想变成 00000000000000000000000000011101
//	//我们可以按位或 | 00000000000000000000000000010000(1向左移动4位 a<<4)
//	a |= (1<<4);// a变成 00000000000000000000000000011101
//	printf("%d\n", a);//29
//	//00000000000000000000000000011101  29
//	
//	//如果我们又想变回去 可以将 00000000000000000000000000011101 按位与 11111111111111111111111111101111
//	                        //11111111111111111111111111101111 是 00000000000000000000000000010000的按位取反
//
//	a &= (~(1 << 4));
//	printf("%d\n", a);
//
//	return 0;
//}

//#include <stdio.h>
//void test1(int arr[])
//{
//	printf("%d\n", sizeof(arr));//8 一个指针类型是4 或者 8 个字节
//}
//void test2(char ch[])
//{
//	printf("%d\n", sizeof(ch));//8
//}
//int main()
//{
//	int arr[10] = { 0 };
//	char ch[10] = { 0 };
//	printf("%d\n", sizeof(arr));//40
//	printf("%d\n", sizeof(ch));//10  ch 占1个字节
//	test1(arr);
//	test2(ch);
//	return 0;
//}
//


////--前置、后置--
////++前置、后置++
//
//int main()
//{
//	int a = 1;
//	int b = a++;//后置++，先使用，后++
//	//b=a,a=a+1
//	printf("a=%d b=%d\n", a, b);//2 1
//	return 0;
//}
//
//
//int main()
//{
//	int a = 1;
//	int b = a--;//后置--，先使用，后--
//	//b=a,a=a-1
//	printf("a=%d b=%d\n", a, b);//0 1
//	return 0;
//}
//
//
//int main()
//{
//	int a = 1;
//	int b = ++a;//前置++，先++，后使用
//	//a=a+1,b=a
//	printf("a=%d b=%d\n", a, b);//2 2
//	return 0;
//}
//
//
//int main()
//{
//	int a = 1;
//	int b = --a;//前置--，先--，后使用
//	//a=a-1,b=a
//	printf("a=%d b=%d\n", a, b);//0 0
//	return 0;
//}


//int main()
//{
//	int a = 10;
//	printf("%d\n", a++);//
//	printf("%d\n", a);//
//
//	return 0;
//}


//int main()
//{
//	int a = (int)3.14;//强制
//	printf("%d\n", a);
//	// int a = int(3.14)//err
//	return 0;
//}


//#include <stdio.h>
//int main()
//{
//	int i = 0, a = 0, b = 2, c = 3, d = 4;
//	//i = a++ && ++b && d++;
//
//	i = a++||++b||d++;
//	
//	printf("a = %d\nb = %d\nc = %d\nd = %d\n", a, b, c, d);//
//	return 0;
//}

////逻辑操作符
////&& || ! - 计算结果是真，使用1表示
//int main()
//{
//	int a = 3 && 5;
//	printf("%d\n", a);
//
//	return 0;
//}